app/controllers/locations_controller.rb

  def search
    search_term = params.fetch(:search, {})[:term]
    search_terms = search_term.gsub(" ", ",").split(",").select(&:present?)
    @location = Location.find_by_zip(params[:search][:term]) if params[:search].present?
---
SELECT * FROM "locations" WHERE ("locations"."zip" = '49720') LIMIT 1

  def search_by_zip
    zip_code = params[:zip]
    @location = Location.find_by_zip(zip_code)
---
SELECT * FROM "locations" WHERE ("locations"."zip" = '49720') LIMIT 1

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("long", "state", "zip", "updated_at", "created_at", "county", "derp", "city", "lat") VALUES(NULL, NULL, NULL, '2012-09-09 03:58:39.212458', '2012-09-09 03:58:39.212458', NULL, NULL, NULL, NULL) RETURNING "id"